def rubles(n):
    lst = {1: "рубль",
           2: "рубля",
           3: "рубля",
           4: "рубля",
           }
    print("рублей" if n > 10 and n < 20 else lst.get(n % 10, "рублей"), end = " ")
def coins(n):
    lst = {1:"копейка",
           2:"копейки",
           3:"копейки",
           4:"копейки",
           }
    print("копеек" if n>10 and n < 20 else lst.get(n%10,"копеек"),end = " ")
def mNumbers(n):
    #1-9
    dict1 = {0:"ноль",
             1:"один",
             2:"два",
             3:"три",
             4:"четыре",
             5:"пять",
             6:"шесть",
             7:"семь",
             8:"восемь",
             9:"девять",
             }
    #20-90
    dict2 = {2: "двадцать",
             3: "тридцать",
             4: "сорок",
             5: "пятьдесят",
             6: "шестьдесят",
             7: "семьдесят",
             8: "восемьдесят",
             9: "девяносто",
             }
    #100-900
    dict3 = {1: "сто",
             2: "двести",
             3: "триста",
             4: "четыреста",
             5: "пятьсот",
             6: "шестьсот",
             7: "семсот",
             8: "восемьсот",
             9: "девятьсот",
             }
    #10-19
    dict4 = {10:"десять",
             11: "одиннадцать",
             12: "двенадцать",
             13: "тринадцать",
             14: "четырнадцать",
             15: "пятнадцать",
             16: "шестнадцать",
             17: "семнадцать",
             18: "восемнадцать",
             19:"девятнадцать",
             }
    printNumber(n,dict1,dict2,dict3,dict4)
def wNumbers(n):
    # 1-9
    dict1 = {0: "ноль",
             1: "одна",
             2: "две",
             3: "три",
             4: "четыре",
             5: "пять",
             6: "шесть",
             7: "семь",
             8: "восемь",
             9: "девять",
             }
    # 20-90
    dict2 = {2: "двадцать",
             3: "тридцать",
             4: "сорок",
             5: "пятьдесят",
             6: "шестьдесят",
             7: "семьдесят",
             8: "восемьдесят",
             9: "девяносто",
             }
    # 100-900
    dict3 = {1: "сто",
             2: "двести",
             3: "триста",
             4: "четыреста",
             5: "пятьсот",
             6: "шестьсот",
             7: "семсот",
             8: "восемьсот",
             9: "девятьсот",
             }
    # 10-19
    dict4 = {10: "десять",
             11: "одиннадцать",
             12: "двенадцать",
             13: "тринадцать",
             14: "четырнадцать",
             15: "пятнадцать",
             16: "шестнадцать",
             17: "семнадцать",
             18: "восемнадцать",
             19: "девятнадцать",
             }
    printNumber(n, dict1, dict2, dict3, dict4)
def printNumber(n,dict1,dict2,dict3,dict4):
    if n >=100:
        print(dict3.get(n//100),end = " ")
        if dict2.get((n // 10) % 10,False):
            print(dict2.get(n // 10 % 10,""), end=" ")
            print(dict1.get(n % 10) if n % 10!=0 else "", end=" ")
        elif (n // 10) % 10 == 0:
            print(dict1.get(n % 10) if n % 10!=0 else "", end=" ")
        else:
            print(dict1.get(n % 10) if n % 10!=0 else "", end=" ")
    elif n >=10 and n < 100:
        if dict2.get(n//10%10):
            print(dict2.get(n//10%10), end = " ")
            print(dict1.get(n % 10) if n % 10!=0 else "", end=" ")
        else:
            print(dict4.get(n%100),end=" ")
    else:
        print(dict1.get(n%10), end = " ")
def printPrice(n):
    a = int(n)
    b = int((n*100-a*100))
    mNumbers(a)
    rubles(a)
    wNumbers(b)
    coins(b)
printPrice(0.0)